'''
여러줄 주석
Created on 2018. 12. 17.

@author: gdj-4
'''
#한줄 주석
print("hello,python")
print()
print(10,20,30,40,50) #,(comma)를 사용하면 구별해서 들어간다.
print("안녕하세요","나의 이름은","홍길동입니다.")
print('작은 따옴표도 문자열 표시가 가능')
print("홍길동이 말했습니다. '여어~ 하사시부리'")
print('홍길동이 말했습니다. "여어~ 하사시부리"')
print('홍길동이 말했습니다. \'여어~ 하사시부리\'')
print("홍길동이 말했습니다. \"여어~ 하사시부리\"")
print("동해물과 백두산이"
      "마르고 닳도록")
print("""  동해물과 백두산이
  마르고 닳도록
  하느님이 보우하사
  우리 나라만세
  무궁화 삼천리 화려강산
  대한사람 대한으로 길이 보전하세""")
print("%d / %d = %.1f" % (100,200,0.5))