package chap6;

/*
 * 1부터 9까지 중복되지 않는 3자리 숫자를임의로 생성하는 프로그램 작성하기.
 */
public class Exam2 {
	public static void main(String[] args) {
		int[] arr = { 1, 2, 3, 4, 5, 6, 7, 8, 9,10 };
		int[] ar = new int[4];
		////////////////////////////////////////////////////////////////////
		for (int i = 0; i < 1000; i++) { //// 자리 뒤바꾸기, 
			int t1 = (int) ((Math.random() * 9)); ///첨자 자리 표시
			int t2 = (int) ((Math.random() * 9)); ///첨자 자리 표시
			int a = arr[t1];
			arr[t1] = arr[t2];
			arr[t2] = a;
		}
		////////////////////////////////////////////////////////////////////
		for (int i = 0; i < ar.length; i++) {
			ar[i] = arr[i]; //arr의 앞의 세자리를 ar로 이동.
			System.out.print(ar[i] + " ");
////////////////////////////////////////////////////////////////////////////
			//세자리 숫자 저장...
		}
	}

}
